blog/app/views/users/show.html.erb

SELECT "microposts".* FROM "microposts" WHERE "microposts"."user_id" = ?  [["user_id", 1]]
---
<h2>Microposts</h2>
<% @user.microposts.each do |micropost| %>